{
    "hero-description": "Computer Scientist. <a href=\"http://www.linkedin.com/in/rcgrande\" > Sr. Software Engineer at Adobe.</a> Developing High Performance Web Based Applications. Coder, Gamer, 8-bit fan, rock and roll lover. Born and raised in Galicia, but living in the sunny <b> Barcelona </b>",
    "EXPERIENCE": "EXPERIENCE",
    "exp-adobe-title": "Software Engineer at Adobe",
    "exp-adobe-date": "(Barcelona, August. 2018 - Today)",
    "exp-adobe-description": "<img src=\"./img/adobe-logo.png\" /><a href=\"https://www.adobe.com/es/commerce/magento.html\" >Adobe</a> stands out in the world of software for its programs for editing web pages, video and digital images. Adobe adquires <a href=\"http://www.magento.com/\" >Magento</a> in August, 2018. The two companies merge technologies to combine Adobe's strength in content and data with Magento's open commerce innovation in their micro-service oriented architechture so-called <a href=\"https://www.adobe.com/es/experience-cloud.html\" >Adobe Experience Cloud.</a>",
    "exp-magento-title": "Software Engineer at Magento Inc.",
    "exp-magento-date": "(Barcelona, October. 2016 - August. 2018)",
    "exp-magento-description": "<img src=\"./img/magento-logo.png\" /> <a href=\"http://www.magento.com/\" >Magento</a> is an online trading platform, with free code (opensource), with which all kinds of projects related to Internet sales can be carried out. Thanks to its modular system concept, it is highly flexible and scalable. Magento provides two distinct platforms: Magento Open Source (previously Magento Community Edition) and Magento Commerce.",
    "exp-cmp-title": "Web Developer at CMP Group",
    "exp-cmp-date": "(Barcelona, July. 2015 - October 2016)",
    "exp-cmp-description": "<img src=\"./img/cmp.png\" /> <a href=\"http://teamcmp.com/\" >CMP Group</a> is a digital entertainment company founded in 2002 in Rochester (NY) with its main headquarters in Barcelona. As Senior Developer, I have been in charge of the backend part of one of the company's products related to <strong> Virtual Reality </strong> and adult content. I have managed the entire development process including integrations and deploys. TDD philosophy, always trying to improve the design and architecture of the application.",
    "exp-softonic-title": "Web Developer at Softonic",
    "exp-softonic-date": "(Barcelona, March. 2013 - July. 2015)",
    "exp-softonic-description": "<img src=\"./img/softonic.jpg\" /> Web development at the multinational <a href=\"http://www.softonic.com\" > Softonic</a> (at its headquarters in Barcelona). <strong> Web programming for High Performance environments </strong> following an agile methodology (SCRUMM framework). Specialist in web development with PHP and MySQL. Subversion, Cache Systems, Design Patterns, Unit and Integration Testing, development in devel, prod, test and stress environments. Code reviewer.",
    "exp-softonic-trainee-title": "Trainee PHP Developer at Softonic",
    "exp-softonic-trainee-date": "(Barcelona, January. 2013 - March. 2013)",
    "exp-softonic-trainee-description": "<img src=\"./img/softonic.jpg\" /> Included in a training plan in the multinational <a href=\"http://www.softonic.com\" > Softonic</a> (at its headquarters in Barcelona) to convert programmers with a previous year of experience into experts in <strong> web programming for High Performance environments </strong>. Certification preparation in MySQL, Design Patterns, SCRUMM Methodology, caching systems...",
    "exp-elogia-title": "Social Media Developer at Elogia",
    "exp-elogia-date": "(Vigo, Sept. 2011 - January 2013)",
    "exp-elogia-description": "<img src=\"./img/ito.jpg\" /> <a href=\"http://elogia.net\" >Elogia </a> is an Online Marketing agency. There I dedicated myself to developing and integrating applications in Social Networks for <i> Viceroy </i>, <i> Mercedes-Benz </i>, <i> HP </i>, <i> Pizza Móvil </i> , <i> CC Gran Vía 2 </i>, among others. I installed, configured and managed websites in Wordpress that would be used as corporate blogs for clients such as <i> Zelnova </i>, <i> Banco Mediolanum </i>, <i> D.O. Rías Baixas </i> or <i> Qualita </i>. I developed a platform for internal use: the <i> Social Media Objectives Framework </i> and the blog <a href=\"http://www.marketing4ecommerce.net\"> marketing4ecommerce </a>. I have also contributed as an author to the company's <a href=\"http://www.elogia.net/blog/author/Ruben-Cougil/\" > blog </a>.",
    "exp-tuglabweb-title": "University Founded: TUGlabWeb",
    "exp-tuglabweb-date": "(Ourense, Sept. 2010 - July 2011)",
    "exp-tuglabweb-description": "<img src=\"./img/rubick.jpg\" /> <a href=\"http://tuglabweb.uvigo.es/\" >TUGlabWEB</a> is an interface for Transferable Utility games that provides a way to perform calculations on the characteristic function that represents a 3 or 4 player game (coalitions) in the framework of the <a href = \"http://es.wikipedia.org/wiki/Teor% C3% ADa_de_juegos \"target=\"_ blank\"> Game Theory </a>. A complete administration panel, user management, managing and saving results obtained, and many more functionalities have been implemented. It has been developed in collaboration with GWAI (Intelligence Agent Group of University of Vigo), SAGATH (Santiago Game Theroy Group), Department of Mathematics of Vigo and SIDOR (Statistical Inference, Decisions and Operations Research).",
    "exp-uvigo-title": "Intern at UVIGO",
    "exp-uvigo-date": "(Ourense, Sept. 2008 - August 2010)",
    "exp-uvigo-description": "<img src=\"./img/uvigotv.jpg\" /> I have worked as an intern in three different departments at <a href=\"http://uvigo.es\" > UVIGO </a>. First, I was at <a href=\"https://fcetou.uvigo.es\" > FCETOU </a> (Faculty of Tourism and Business of Ourense) and shortly after at <a href =\"http://fcou.uvigo.es/\"target =\"_blank\"> FCOU </a> (Faculty of Sciences of Ourense). I was dedicated to providing IT support and maintenance. In 2010 I started working in Multimedia Services and Videoconference Sites at UVIGO <a href=\"http://tv.uvigo.es/\" > (tv.uvigo.es) </ a >. I did maintenance, control and configuration of AG (Access Grid) and videoconferencing systems (Ipela, Polycom, Adobe Connect…). In addition, I worked with production and post-production of events, room sound, recording and processing.",
    "NANO PROJECTS": "NANO PROJECTS",
    "ACTIVITY": "PROFESSIONAL ACTIVITY",
    "act-lasalle-title": "University professor at La Salle (Ramón Llull University)",
    "act-lasalle-date": "(Barcelona, Sep. 2017 - Today)",
    "act-lasalle-description": "<img src=\"./img/lasalle-logo.png\"/> University teacher. Teaching the subject <a href=\"https://github.com/rubencougil/performance-in-web-applications\" > Web Performance </a>, \"Backend programming languages ​​\", and directing several TFMs (Final Master's Projects) at <a href = \" https: //www.salleurl.edu/es/estudios/master-universitario-en-programacion-web-de-alto-rendimiento \"target =\"_blank\"> High Performance Web Development Master </a>. This master provides a solid training in programming and web technologies, allowing students to obtain the required skills to immediately join any company with an Internet presence.",
    "act-geekshubs-title": "Professor at GeeksHubs Academy",
    "act-geekshubs-date": "(Valencia, November. 2019 - Today)",
    "act-geekshubs-description": "<img src=\"./img/geekshubs.jpg\"/> Professor at <a href=\"https://geekshubs.com/\" >GeeksHubs</a>: Reinventing the future of education and recruitment tech. We believe in the power of technology to make an impact. Teacher at <a href=\"https://bootcamp.geekshubsacademy.com/online/devops/\" > DevOps Bootcamp</a>, aimed at experienced professionals who want to improve their skills in this area, specialize in DevOps, IT architectures and infrastructures.",
    "act-codely-title": "Professor en Codely.tv Pro",
    "act-codely-date": "(Barcelona, June. 2017 - Today)",
    "act-codely-description": "<img src=\"./img/codelytv-logo.png\" /> Professor at <a href=\"https://codely.tv/\" >Codely.tv Pro</a>: Learn from experienced professionals in hands-on, straightforward courses. Improve your skills, specialize, and keep advancing in your career. Online courses for programmers. Created several courses such as <a href = \"https://pro.codely.tv/library/elkbeats-centraliza-la-gestion-de-logs-con-the-elastic-stack\"  > ELK + Beats: Centralize your logs with Elastic Stack </a>, and the most recent <a href=\"https://pro.codely.tv/library/prometheus\" > Monitoring with Prometheus </ a> and <a href=\"https://pro.codely.tv/library/grafana-course-with-prometheus\" > View Prometheus with Grafana. </a>",
    "act-rekomendo-title": "Creator of Rekomendo!",
    "act-rekomendo-date": "(Barcelona, July 2017 - January 2020)",
    "act-rekomendo-description": "<img src=\"./img/rek-logo.png\" /> <a href=\"https://www.youtube.com/watch?v=WadYoipE97E\" >Rekomendo!</a> was a cultural recommender for discovering new books, video games, music, board games, movies and series that you will like. You could rate and send personalized recommendations to your friends. Save your scores, and never go blank when someone asked you for advice. Was available for mobile supporting <a href=\"https://www.youtube.com/watch?v=WadYoipE97E\" >Android and iOS devices.</a>",
    "ACADEMIC": "ACADEMIC FORMATION",
    "std-comp-science-degree-title": "Bachelor of Computer Engineering",
    "std-comp-science-degree-date": "(Ourense, 2008-2011)",
    "std-comp-science-degree-description": "I got a degree in Computer Engineering at the School of Computer Engineering of the University of Vigo <a href=\"http://www.esei.uvigo.es/\" > (ESEI) </a>, Ourense campus, Galicia.",
    "std-comp-science-tech-title": "Technical Engineer in Informatic Management",
    "std-comp-science-tech-date": "(Ourense, 2003-2008)",
    "std-comp-science-tech-description": "I got a degree in Computer Engineering Management at the School of Computer Engineering of the University of Vigo <a href=\"http://www.esei.uvigo.es/\" > ( ESEI) </a>, campus of Ourense, Galicia.",
}