{
    "hero-description": "Ingeniero Informático. <a href=\"http://www.linkedin.com/in/rcgrande\" >Sr. Software Engineer en Adobe.</a> Realizando desarrollo Web de Alto Rendimiento. Programador, Gamer, retro-fan de los 8-bits, amante del Rock y gallego orgulloso. Vivo en <b>Barcelona</b>.",
    "EXPERIENCE": "EXPERIENCIA",
    "exp-adobe-title": "Software Engineer en Adobe.",
    "exp-adobe-date": "(Barcelona, Agosto. 2018 - Actualidad)",
    "exp-adobe-description": "<img src=\"./img/adobe-logo.png\" /> <a href=\"https://www.adobe.com/es/commerce/magento.html\" >Adobe</a> Destaca en el mundo del software por sus programas de edición de páginas web, vídeo e imagen digital. Adobe adquiere <a href=\"http://www.magento.com/\" >Magento</a> en Agosto de 2018. Las dos empresas fusionarán tecnologías para combinar la fortaleza de Adobe en contenido y datos con la innovación de comercio abierto de Magento en su denominado <a href=\"https://www.adobe.com/es/experience-cloud.html\" >Adobe Experience Cloud.</a>",
    "exp-magento-title": "Software Engineer en Magento Inc.",
    "exp-magento-date": "(Barcelona, Octubre. 2016 - Agosto. 2018)",
    "exp-magento-description": "<img src=\"./img/magento-logo.png\" /> <a href=\"http://www.magento.com/\" >Magento</a> es una plataforma de comercio en línea, de código liberado (opensource), con el que se pueden llevar a cabo todo tipo de proyectos relacionados con la venta en Internet. Gracias a su concepción de sistema modular, es altamente flexible y escalable. Magento ofrece dos plataformas distintas: Magento Open Source  (anteriormente Magento Community Edition) y Magento Commerce.",
    "exp-cmp-title": "Web Developer en CMP Group.",
    "exp-cmp-date": "(Barcelona, Julio. 2015 - Octubre 2016)",
    "exp-cmp-description": "<img src=\"./img/cmp.png\" /> <a href=\"http://teamcmp.com/\" >CMP Group</a> es una empresa de entretenimiento digital fundada en 2002 en Rochester (NY) con su sede principal en Barcelona. Como Senior Developer, me he encargado de la parte de backend de uno de los productos de la compañía relaccionado con <strong> Realidad Virtual </strong> y contenido para adultos. He gestionado todo el proceso de desarrollo incluido integraciones y deploys. Filosofía TDD, intentando siempre mejorar el diseño y la arquitectura de la aplicación.",
    "exp-softonic-title": "Web Developer at Softonic.",
    "exp-softonic-date": "(Barcelona, March. 2013 - July. 2015)",
    "exp-softonic-description": "<img src=\"./img/softonic.jpg\" /> Desarrollo Web en la multinacional <a href=\"http://www.softonic.com\" > Softonic</a> (en su sede en Barcelona). <strong>Programación web para entornos de Alto Rendimiento</strong> siguiendo una metodología ágil (SCRUMM framework). Especialista en desarrollo web con PHP y MySQL. Subversion, Sistemas de Cache, Patrones de Diseño, Testing unitarios y de integración, desarrollo en entornos de devel, prod, test y stress. Code reviewer.",
    "exp-softonic-trainee-title": "Trainee PHP Developer en Softonic",
    "exp-softonic-trainee-date": "(Barcelona, Enero. 2013 - Marzo. 2013)",
    "exp-softonic-trainee-description": "<img src=\"./img/softonic.jpg\" /> Incluido en un plan de formación en la multinacional <a href=\"http://www.softonic.com\" > Softonic</a> (en su sede en Barcelona) para convertir a programadores con un año de experiencia prevía en expertos en <strong>programación web para entornos de Alto Rendimiento</strong>. Preparación de certificación en MySQL, Patrones de Diseño, Metodología SCRUMM, sistemas de caché...",
    "exp-elogia-title": "Social Media Developer en Elogia.",
    "exp-elogia-date": "(Vigo, Sept. 2011 - Enero 2013)",
    "exp-elogia-description": "<a href=\"http://elogia.net\" >Elogia</a> es una agencia de Marketing Online. Allí me dediqué a desarrollar e integrar aplicaciones en Redes Sociales para <i>Viceroy</i>, <i>Mercedes-Benz</i>, <i>HP</i>, <i>Pizza Móvil</i>, <i>CC Gran Vía 2</i>, entre otros . Instalé, configuré y administré sitios web en Wordpress que sería utilizados como blogs corporativos para clientes como <i>Zelnova</i>, <i>Banco Mediolanum</i>, <i>D.O. Rías Baixas</i> o <i>Qualita</i> . Desarrollé una plataforma de uso interno: el <i>Social Media Objectives Framework</i> y el blog <a href=\"http://www.marketing4ecommerce.net\"> marketing4ecommerce</a>. También colaboré como autor en el  <a href=\"http://www.elogia.net/blog/autor/Ruben-Cougil/\" >blog</a> de la compañía.",
    "exp-tuglabweb-title": "PFC Financiado: TUGlabWeb.",
    "exp-tuglabweb-date": "(Ourense, Sept. 2010 - Julio 2011)",
    "exp-tuglabweb-description": "<img src=\"./img/rubick.jpg\" /> <a href=\"http://tuglabweb.uvigo.es/\" >TUGlabWEB</a> es una interfaz para juegos de Utilidad Transferible que provee una forma de realizar cálculos sobre la función característica que representa a un juego de 3 o 4 jugadores (coaliciones) en el marco de la <a href=\"http://es.wikipedia.org/wiki/Teor%C3%ADa_de_juegos\" > Teoría de Juegos </a>. Se han implementado un completo panel de administración, gestión de usuarios, manejar y guardar resultados obtenidos, y muchas más funcionalidades. Se ha desarrollado en colaboración con GWAI (Intelligence Agent Group of University of Vigo ), SAGATH (Santiago Game Theroy Group), Departamento de Matemáticas de Vigo y SIDOR (Statistical Inference, Decisions and Operations Research).",
    "exp-uvigo-title": "Becario en UVIGO",
    "exp-uvigo-date": "(Ourense, Sept. 2008 - Agosto 2010)",
    "exp-uvigo-description": "<img src=\"./img/uvigotv.jpg\" /> He trabajado como becario en tres departamentos diferentes en <a href=\"http://uvigo.es\" >UVIGO</a>. Primero, estuve en <a href=\"https://fcetou.uvigo.es\" >FCETOU</a> (Facultad de Turismo y Empresariales de Ourense) y poco después en <a href=\"http://fcou.uvigo.es/\" >FCOU</a> (Facultad de Ciencias de Ourense). Me dedicaba a dar soporte informático y a mantenimiento En 2010 empecé a trabajar en Servicios Multimedia y Sitemas de Videoconferencia en UVIGO <a href=\"http://tv.uvigo.es/\" >(tv.uvigo.es)</a>. Hice mantenimiento , control y configuración de sistemas AG (Access Grid) y de videoconferencia (Ipela, Polycom, Adobe Connect…). Además, trabajé con producción y post-producción de eventos, sonorización de salas, grabación y procesado.",
    "TECHNOLOGIES": "TECNOLOGIAS",
    "ACTIVITY": "ACTIVIDAD PROFESIONAL",
    "act-lasalle-title": "Profesor universitario en La Salle (Universidad Ramón Llull).",
    "act-lasalle-date": "(Barcelona, Sep. 2017 - Actualidad)",
    "act-lasalle-description": "<img src=\"./img/lasalle-logo.png\" />Docente Universitario. Impartiendo la asignatura <a href=\"https://github.com/rubencougil/rendimiento-en-aplicaciones-web\" >Rendimiento Web</a>, \"Lenguajes de programación Backend\", y dirigiendo TFM (Trabajo Fin de Master) en el <a href=\"https://www.salleurl.edu/es/estudios/master-universitario-en-programacion-web-de-alto-rendimiento\" > Master de Desarollo Web de Alto Rendimiento</a>. Este master aporta una formación sólida de programación y tecnologías web, permitiendo a los estudiantes obtener las capacidades requeridas para incorporarse de manera inmediata a cualquier empresa con presencia en internet.",
    "act-geekshubs-title": "Profesor en GeeksHubs Academy.",
    "act-geekshubs-date": "(Valencia, Noviembre. 2019 - Actualidad)",
    "act-geekshubs-description":  "<img src=\"./img/geekshubs.jpg\" /> Profesor en <a href=\"https://geekshubs.com/\" >GeeksHubs</a>: Reinventando el futuro de la educación y el recruitment tech. Creemos en el poder de la tecnología para generar impacto. Docente en <a href=\"https://bootcamp.geekshubsacademy.com/online/devops/\" > DevOps Bootcamp </a>, dirigido a Profesionales con experiencia que quieran mejorar sus habilidades en esta área, especializarse en DevOps, arquitecturas e infraestructuras IT.",
    "act-codely-title": "Profesor en Codely.tv Pro.",
    "act-codely-date": "(Barcelona, Junio. 2017 - Actualidad)",
    "act-codely-description": " <img src=\"./img/codelytv-logo.png\" /> Profesor en <a href=\"https://codely.tv/\" >Codely.tv Pro</a>: Aprende de profesionales con experiencia en cursos prácticos y sin rodeos. Mejora tus habilidades, especialízate, y sigue avanzando en tu carrera. Cursos online para programadores. Creador de los cursos <a href=\"https://pro.codely.tv/library/elkbeats-centraliza-la-gestion-de-logs-con-the-elastic-stack\" > ELK + Beats: Centraliza tus logs con Elastic Stack</a>, <a href=\"https://pro.codely.tv/library/prometheus\" > Monitoring con Prometheus</a> y <a href=\"https://pro.codely.tv/library/curso-grafana-con-prometheus\" > Visualiza Prometheus con Grafana</a>",
    "act-rekomendo-title": "Creador de Rekomendo!",
    "act-rekomendo-date": "(Barcelona, Julio. 2017 - Enero 2020)",
    "act-rekomendo-description": "<img src=\"./img/rek-logo.png\" /> <a href=\"https://www.youtube.com/watch?v=WadYoipE97E\" >Rekomendo!</a> fue un recomendador cultural. Descubre nuevos libros, videojuegos, música, juegos de mesa, películas y series que te <a href=\"https://medium.com/@rcougil/la-historia-detr%C3%A1s-de-rekomendo-mi-app-de-recomendaci%C3%B3n-cultural-93864fdb75d6\" >gustarán</a>. Podías puntuar y envíar recomendaciones personalizadas a tus amigos. Guardar tus puntuaciones y nunca te quedabas en blanco cuando alguien te pedía consejo. Estuvo disponible para dispositivos <a href=\"https://www.youtube.com/watch?v=WadYoipE97E\" >Android y iOS</a>",
    "ACADEMIC": "ESTUDIOS",
    "std-comp-science-degree-title": "Licenciado en Ingeniería Informática.",
    "std-comp-science-degree-date": "(Ourense, 2008-2011)",
    "std-comp-science-degree-description": "Conseguí el título en Ingeniería Informática en la Escuela Superior de Ingeniería Informática de la universidad de Vigo <a href=\"http://www.esei.uvigo.es/\" >(ESEI)</a>, campus de Ourense, Galicia.",
    "std-comp-science-tech-title": "Ingeniero Técnico en Informática de Gestión.",
    "std-comp-science-tech-date": "(Ourense, 2003-2008)",
    "std-comp-science-tech-description": "Conseguí el título en Ingeniería Técnica Informática de Gestión en la Escuela Superior de Ingeniería Informática de la universidad de Vigo <a href=\"http://www.esei.uvigo.es/\" >(ESEI)</a> , campus de Ourense, Galicia."
}